Documents/Поселение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Поселение</Name>
			<BasedOn>
				<xr:Item>Document.Бронирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрожитыеДниПостояльца</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Постоялец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеПостояльцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГостиницы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГостиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентУвеличения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКУплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бронирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поселение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поселение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПрожитыеДниПостояльца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ПрожитыеДниПостояльца</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Постоялец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеПостояльцев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНаНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаНомера</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидНомера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНомера</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Поселение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрожитыеДниПостояльца 
	Движения.ПрожитыеДниПостояльца.Записывать = Истина;
	Движение = Движения.ПрожитыеДниПостояльца.Добавить();
	Движение.Период = Дата;
	Движение.Постоялец = Постоялец;   
	Движение.КоличествоДней = (КонецПериода - НачалоПериода)/3600/24;  

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Бронирование") Тогда
		// Заполнение шапки
		КонецПериода = ДанныеЗаполнения.КонецПериода;
		НачалоПериода = ДанныеЗаполнения.НачалоПериода;
		НомерГостиницы = ДанныеЗаполнения.НомерГостиницы;
		Постоялец = ДанныеЗаполнения.Постоялец;   
		Бронирование = ДанныеЗаполнения.Ссылка;
		РасчетЗначений();
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры        


Процедура РасчетЗначений() Экспорт
	РазностьВДнях = (КонецПериода - НачалоПериода)/3600/24;  
	ОтборЦена = Новый Структура("ВидНомера", НомерГостиницы.ВидНомера);
	ЦенаНомера = РегистрыСведений.ЦеныНаНомера.ПолучитьПоследнее(НачалоПериода, ОтборЦена);       
	СуммаОплаты = РазностьВДнях * ЦенаНомера.Стоимость;  
		
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрожитыеДниПостояльцаОбороты.КоличествоДнейОборот КАК КоличествоДнейОборот
		|ИЗ
		|	РегистрНакопления.ПрожитыеДниПостояльца.Обороты КАК ПрожитыеДниПостояльцаОбороты
		|ГДЕ
		|	ПрожитыеДниПостояльцаОбороты.Постоялец = &Постоялец";    
	
	Запрос.УстановитьПараметр("Постоялец", Постоялец);	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КоличествоПрожитыхСуток = ВыборкаДетальныеЗаписи.КоличествоДнейОборот;
		КонецЦикла;   	
	Иначе
			КоличествоПрожитыхСуток = 0;
	КонецЕсли;
      
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА        
	
	ПроцентСкидки = Окр((КоличествоПрожитыхСуток/10) + 0.5, 0, 0);   
	Если ПроцентСкидки > 20 Тогда
		ПроцентСкидки = 20;
	КонецЕсли;
	
	РасчетСуммыКУплате();

КонецПроцедуры     


Процедура РасчетСуммыКУплате()  
	СуммаОплаты = СуммаОплаты +  СуммаОплаты * (ПроцентУвеличения / 100);
	СуммаСкидки = СуммаОплаты * ПроцентСкидки / 100;
	СуммаКУплате = СуммаОплаты - СуммаСкидки;	
КонецПроцедуры
